RT-Thread/rt-thread/bsp/at32/libraries/AT32F413_Firmware_Library/drivers/src/at32f413_flash.c
  /* disable the usdprgm bit */
  FLASH->ctrl_bit.usdprgm = FALSE;

  /* return the user system data program status */
  return status;
}

/**
  * @brief  config erase/program protection for the desired sectors.
  * @param  sector_bits(1:ENABLE, 0:DISABLE)
  *         the pointer of the address of the sectors to be erase/program protected.
  *         general every bit is used to protect the 4KB bytes, and the last one bit
  *         is used to protect the rest.
  * @retval status: the returned value can be: FLASH_PROGRAM_ERROR,
  *         FLASH_EPP_ERROR, FLASH_OPERATE_DONE or FLASH_OPERATE_TIMEOUT.
  */
flash_status_type flash_epp_set(uint32_t *sector_bits)
{
  uint16_t epp_data[4] = {0xFFFF,0xFFFF,0xFFFF,0xFFFF};
  flash_status_type status = FLASH_OPERATE_DONE;
  sector_bits[0] = (uint32_t)(~sector_bits[0]);
  epp_data[0] = (uint16_t)((sector_bits[0] >> 0) & 0xFF);
  epp_data[1] = (uint16_t)((sector_bits[0] >> 8) & 0xFF);
  epp_data[2] = (uint16_t)((sector_bits[0] >> 16) & 0xFF);
  epp_data[3] = (uint16_t)((sector_bits[0] >> 24) & 0xFF);

  /* unlock the user system data */
  FLASH->usd_unlock = FLASH_UNLOCK_KEY1;
  FLASH->usd_unlock = FLASH_UNLOCK_KEY2;
  while(FLASH->ctrl_bit.usdulks==RESET);

  FLASH->ctrl_bit.usdprgm = TRUE;
  USD->epp0 = epp_data[0];
  /* wait for operation to be completed */
  status = flash_operation_wait_for(PROGRAMMING_TIMEOUT);

  if(status == FLASH_OPERATE_DONE)
  {
    USD->epp1 = epp_data[1];
    /* wait for operation to be completed */
    status = flash_operation_wait_for(PROGRAMMING_TIMEOUT);
  }
  if(status == FLASH_OPERATE_DONE)
  {
    USD->epp2 = epp_data[2];
    /* wait for operation to be completed */
    status = flash_operation_wait_for(PROGRAMMING_TIMEOUT);
  }
  if(status == FLASH_OPERATE_DONE)
  {
    USD->epp3 = epp_data[3];
    /* wait for operation to be completed */
    status = flash_operation_wait_for(PROGRAMMING_TIMEOUT);
  }
  /* disable the usdprgm bit */
  FLASH->ctrl_bit.usdprgm = FALSE;

  /* return the erase/program protection operation status */
  return status;
}

/**
  * @brief  return the flash erase/program protection status.
  * @param  sector_bits: pointer to get the epps register.
  * @retval none
  */
void flash_epp_status_get(uint32_t *sector_bits)
{
  /* return the flash erase/program protection register value */
  sector_bits[0] = (uint32_t)(FLASH->epps);
}

/**
  * @brief  enable or disable the flash access protection.
  * @note   if the user has already programmed the other user system data before calling
  *         this function, must re-program them since this function erase all user system data.
  * @param  new_state: new state of the flash access protection.
  *         this parameter can be: TRUE or FALSE.
  * @retval status: the returned value can be: FLASH_PROGRAM_ERROR,
  *         FLASH_EPP_ERROR, FLASH_OPERATE_DONE or FLASH_OPERATE_TIMEOUT.
  */
flash_status_type flash_fap_enable(confirm_state new_state)
{
  flash_status_type status = FLASH_OPERATE_DONE;

  /* unlock the user system data */
  FLASH->usd_unlock = FLASH_UNLOCK_KEY1;
  FLASH->usd_unlock = FLASH_UNLOCK_KEY2;
  while(FLASH->ctrl_bit.usdulks==RESET);

  FLASH->ctrl_bit.usders = TRUE;
  FLASH->ctrl_bit.erstr = TRUE;
  /* wait for operation to be completed */
  status = flash_operation_wait_for(ERASE_TIMEOUT);

  /* disable the usders bit */
  FLASH->ctrl_bit.usders = FALSE;

  if(status == FLASH_OPERATE_DONE)
  {
    if(new_state == FALSE)
    {
      /* enable the user system data programming operation */
      FLASH->ctrl_bit.usdprgm = TRUE;
      USD->fap = FAP_RELIEVE_KEY;

      /* Wait for operation to be completed */
      status = flash_operation_wait_for(ERASE_TIMEOUT);

      /* disable the usdprgm bit */
      FLASH->ctrl_bit.usdprgm = FALSE;
    }
  }

  /* return the flash access protection operation status */
  return status;
}

/**
  * @brief  check the flash access protection status.
  * @param  none
  * @retval flash access protection status(SET or RESET)
  */
flag_status flash_fap_status_get(void)
{
  return (flag_status)FLASH->usd_bit.fap;
}

/**
  * @brief  program the flash system setting byte in usd: wdt_ato_en / depslp_rst / stdby_rst.
  * @param  usd_ssb: the system setting byte
  * @note   this parameter usd_ssb must contain a combination of all the following 3 types of data
  *         type 1: wdt_ato_en, select the wdt auto start
  *         this data can be one of the following values:
  *         - USD_WDT_ATO_DISABLE: disable wdt auto start
  *         - USD_WDT_ATO_ENABLE: enable wdt auto start
  *         type 2: depslp_rst, reset event when entering deepsleep mode.
  *         this data can be one of the following values:
  *         - USD_DEPSLP_NO_RST: no reset generated when entering in deepsleep
  *         - USD_DEPSLP_RST: reset generated when entering in deepsleep
  *         type 3: stdby_rst, reset event when entering standby mode.
  *         this data can be one of the following values:
  *         - USD_STDBY_NO_RST: no reset generated when entering in standby
  *         - USD_STDBY_RST: reset generated when entering in standby
  * @retval status: the returned value can be: FLASH_PROGRAM_ERROR,
  *         FLASH_EPP_ERROR, FLASH_OPERATE_DONE or FLASH_OPERATE_TIMEOUT.
  */
flash_status_type flash_ssb_set(uint8_t usd_ssb)
{
  flash_status_type status = FLASH_OPERATE_DONE;

  /* unlock the user system data */
  FLASH->usd_unlock = FLASH_UNLOCK_KEY1;
  FLASH->usd_unlock = FLASH_UNLOCK_KEY2;
  while(FLASH->ctrl_bit.usdulks==RESET);

  /* enable the user system data programming operation */
  FLASH->ctrl_bit.usdprgm = TRUE;

  USD->ssb = usd_ssb;
  /* wait for operation to be completed */
  status = flash_operation_wait_for(PROGRAMMING_TIMEOUT);

  /* disable the usdprgm bit */
  FLASH->ctrl_bit.usdprgm = FALSE;

  /* return the user system data program status */
  return status;
}

/**
  * @brief  return the flash system setting byte status.
  * @param  none
  * @retval values from flash_usd register: wdt_ato_en(bit0), depslp_rst(bit1) and stdby_rst(bit2).
  */
uint8_t flash_ssb_status_get(void)
{
  /* return the system setting byte status */
  return (uint8_t)(FLASH->usd >> 2);
}

/**
  * @brief  enable or disable the specified flash interrupts.
  * @param  flash_int: specifies the flash interrupt sources to be enabled or disabled.
  *         this parameter can be any combination of the following values:
  *         - FLASH_ERR_INT
  *         - FLASH_ODF_INT
  *         - FLASH_SPIM_ERR_INT
  *         - FLASH_SPIM_ODF_INT
  * @param  new_state: new state of the specified flash interrupts.
  *         this parameter can be: TRUE or FALSE.
  * @retval none
  */
void flash_interrupt_enable(uint32_t flash_int, confirm_state new_state)
{
  if(flash_int & FLASH_ERR_INT)
    FLASH->ctrl_bit.errie = new_state;
  if(flash_int & FLASH_ODF_INT)
    FLASH->ctrl_bit.odfie = new_state;
  if(flash_int & FLASH_SPIM_ERR_INT)
    FLASH->ctrl3_bit.errie = new_state;
  if(flash_int & FLASH_SPIM_ODF_INT)
    FLASH->ctrl3_bit.odfie = new_state;
}

/**
  * @brief  select spim supports extended spi flash chip model.
  * @param  mode: the extended spi flash model
  * @retval none
  */
void flash_spim_model_select(flash_spim_model_type mode)
{
  FLASH->select = mode;

  /* dummy read */
  flash_spim_dummy_read();
}

/**
  * @brief  set the range of encryption in spim flash.
  *         when the address is larger than this value, the writing data will be
  *         directly written to spim without encryption.
  * @param  decode_address: the end address of encrypted data in spim
  * @retval none
  */
void flash_spim_encryption_range_set(uint32_t decode_address)
{
  FLASH->da = decode_address;
}

/**
  * @brief  operate the flash spim dummy read.
  * @param  none
  * @retval none
  */
void flash_spim_dummy_read(void)
{
  UNUSED(*(__IO uint32_t*)FLASH_SPIM_START_ADDR);
  UNUSED(*(__IO uint32_t*)(FLASH_SPIM_START_ADDR + 0x1000));
  UNUSED(*(__IO uint32_t*)(FLASH_SPIM_START_ADDR + 0x2000));
}

/**
  * @brief  mass program for flash spim.
  * @param  address: specifies the start address to be programmed, word or halfword alignment is recommended.
  * @param  buf: specifies the pointer of data to be programmed.
  * @param  cnt: specifies the data counter to be programmed.
  * @retval status: the returned value can be: FLASH_PROGRAM_ERROR,
  *         FLASH_EPP_ERROR, FLASH_OPERATE_DONE or FLASH_OPERATE_TIMEOUT.
  */
flash_status_type flash_spim_mass_program(uint32_t address, uint8_t *buf, uint32_t cnt)
{
  flash_status_type status = FLASH_OPERATE_DONE;
  uint32_t index, temp_offset;
  if(address >= FLASH_SPIM_START_ADDR)
  {
    temp_offset = cnt % 4;
    if((temp_offset != 0) && (temp_offset != 2))
      return status;

